Repository: Korniszon99/SSPWPhotoTaskGame
Catalog: photo_game/lang/*.arb
Languages: pl

# locale
source: en
pl: pl

# fut
source: Students' Union Of Polish Universities of Technology
pl: Samorząd Studentów Politechniki Warszawskiej

source: Log in
pl: Zaloguj się

source: Sign up
pl: Zarejestruj się

# welcomeMessage
source: Welcome! Draw tasks, take photos and have fun
pl: Witaj! Wylosuj zadania, rób zdjęcia i baw się dobrze

# galleryLoadError
source: An error occurred while loading the gallery.
pl: Wystąpił błąd podczas ładowania galerii.

# gallery
source: Photo gallery
pl: Galeria zdjęć

# gallerySubtitle
source: All photos uploaded by participants
pl: Wszystkie zdjęcia przesłane przez uczestników

source: Sort
pl: Sortuj

source: Filters
pl: Filtry

source: Newest
pl: Najnowsze

source: Oldest
pl: Najstarsze

# lowestRating
source: Lowest rated
pl: Najniżej oceniane

# highestRating
source: Highest rated
pl: Najwyżej oceniane

source: Task
pl: Zadanie

source: Task photo
pl: Zdjęcie zadania

source: All
pl: Wszystkie

source: Min. rating
pl: Min. ocena

# filter
source: Apply filters
pl: Zastosuj filtry

source: Clear filters
pl: Wyczyść filtry

source: No photos found.
pl: Brak zdjęć.

# noPhotosFoundDescription
source: No photos matching the specified criteria were found.
pl: Nie znaleziono zdjęć spełniających podane kryteria.

# galleryEmpty
source: The gallery is still empty. Be the first and upload a photo!
pl: Galeria jest jeszcze pusta. Bądź pierwszy i prześlij zdjęcie!

# ratingCount
source: {count, plural, =0{No ratings} =1{{avg} ({count} rating)} other{{avg} ({count} ratings)}}
pl: {count, plural, =0{Brak ocen} =1{{avg} ({count} ocena)} few{{avg} ({count} oceny)} other{{avg} ({count} ocen)}}

# ratingCountWithoutAvg
source: {count, plural, =0{No ratings} =1{({count} rating)} other{({count} ratings)}}
pl: {count, plural, =0{Brak ocen} =1{({count} ocena)} few{({count} oceny)} other{({count} ocen)}}

source: Your rating
pl: Twoja ocena

# rate
source: Rate this photo
pl: Oceń to zdjęcie

# ratingDisabled
source: Rating is currently disabled.
pl: Ocenianie jest obecnie wyłączone.

source: Previous
pl: Poprzednia

source: Next
pl: Następna

# welcome
source: Welcome, {username}!
pl: Witaj, {username}!

# dashboardSubtitle
source: Here's a summary of your activity in the game
pl: Oto podsumowanie Twojej aktywności w grze

# finished
source: Completed
pl: Ukończone

# pending
source: To do
pl: Do zrobienia

source: Total
pl: Razem

# photosAddingDisabled
source: Adding photos is currently disabled.
pl: Dodawanie zdjęć jest obecnie wyłączone.

# photoRateLimitReached
source: Too many uploads! Try again in {count, plural, one{{count} second} other{{count} seconds}}.
pl: Za dużo uploadów! Spróbuj ponownie za {count, plural, one{{count} sekundę} few{{count} sekundy} other{{count} sekund}}.

source: Invalid CSRF token!
pl: Nieprawidłowy token CSRF!

# taskNotAssigned
source: You don't have this task assigned.
pl: Nie masz przypisanego tego zadania.

# taskAlreadyCompleted
source: This task has already been completed.
pl: To zadanie zostało już ukończone.

# photoNoFile
source: No file selected or an error occurred during upload.
pl: Nie wybrano pliku lub wystąpił błąd podczas przesyłania.

# photoMaxSizeExceeded
source: File is too large. Maximum size is {size}.
pl: Plik jest za duży. Maksymalny rozmiar to {size}.

# photoInvalidType
source: Invalid file type. Allowed types: {types}.
pl: Nieprawidłowy typ pliku. Dozwolone typy to: {types}.

# photoCompressError
source: Failed to process the photo.
pl: Nie udało się przetworzyć zdjęcia.

# photoUploadError
source: An error occurred while uploading the photo.
pl: Wystąpił błąd podczas przesyłania zdjęcia.

# photoUploadSuccess
source: Photo uploaded successfully!
pl: Zdjęcie zostało pomyślnie przesłane!

source: Unknown method
pl: Nieznana metoda

source: Unknown rating value
pl: Nieznana wartość oceny

# drawTaskRateLimitReached
source: Too many draws! Try again in {count, plural, one{{count} second} other{{count} seconds}}.
pl: Zbyt wiele losowań! Spróbuj ponownie za {count, plural, one{{count} sekundę} few{{count} sekundy} other{{count} sekund}}.

# drawTaskLimit
source: You have {count} tasks without uploaded photos. Upload photos before drawing new tasks.
pl: Masz {count} zadań bez przesłanego zdjęcia. Prześlij zdjęcia przed wylosowaniem nowych zadań.

# noTasksAvailable
source: No tasks available to draw.
pl: Brak dostępnych zadań do wylosowania.

# allTasksDrawn
source: No new tasks to draw – complete your current ones first!
pl: Nie ma nowych zadań do wylosowania – wykonaj najpierw bieżące!

# taskDrawError
source: An error occurred while drawing a task.
pl: Wystąpił błąd podczas losowania zadania.

# accessDenied
source: Access to Admin Panel denied!
pl: Brak dostępu do panelu Administratora!

# cannotDeleteOwnAccount
source: You cannot delete your own account from the admin panel!
pl: Nie możesz usunąć swojego konta z panelu admina!

# noUserFound
source: User not found.
pl: Nie znaleziono użytkownika.

# userDeleted
source: User {username} has been deleted.
pl: Użytkownik {username} został usunięty.

# userDeleteError
source: An error occurred while deleting the user.
pl: Wystąpił błąd podczas usuwania użytkownika.

source: Invalid parameters.
pl: Nieprawidłowe parametry.

# noTaskFound
source: Task not found.
pl: Nie znaleziono zadania.

# taskDeleted
source: Task has been deleted.
pl: Zadanie zostało usunięte.

# taskDeletedSummary
source: Also deleted {assigned} assignments, {completed} completed tasks and {photos} related photos.
pl: Usunięto również {assigned} przypisań, {completed} ukończonych zadań i {photos} powiązanych zdjęć.

# taskDeleteError
source: An error occurred while deleting the task.
pl: Wystąpił błąd podczas usuwania zadania.

# photoDeleted
source: Photo has been deleted.
pl: Zdjęcie zostało usunięte.

# photoDeleteError
source: An error occurred while deleting the photo.
pl: Wystąpił błąd podczas usuwania zdjęcia.

# usersLoadError
source: An error occurred while loading users.
pl: Wystąpił błąd podczas ładowania użytkowników.

source: Admin Panel
pl: Panel Administratora

# adminPanelSubtitle
source: Manage users and data
pl: Zarządzaj użytkownikami i danymi

source: Users
pl: Użytkowników

source: User
pl: Użytkownik

source: Tasks
pl: Zadań

source: Photos
pl: Zdjęć

source: User list
pl: Lista użytkowników

source: Search
pl: Szukaj

source: Search by ID or username
pl: Szukaj według ID lub nazwy użytkownika

source: Clear search
pl: Wyczyść wyszukiwanie

# usersSearchResults
source: Found {count, plural, one{{count} user} other{{count} users}} for query: "<strong>{query}</strong>"
pl: Znaleziono {count, plural, one{{count} użytkownika} other{{count} użytkowników}} dla zapytania: "<strong>{query}</strong>"

source: No users found.
pl: Nie znaleziono użytkowników.

source: No users.
pl: Brak użytkowników.

# tryOtherSearch
source: Try using a different query or <a href="panel.php">clear search</a>
pl: Spróbuj użyć innego zapytania lub <a href="panel.php">wyczyść wyszukiwanie</a>

source: Username
pl: Nazwa użytkownika

source: Assigned
pl: Przypisane

source: Completed
pl: Ukończone

source: Actions
pl: Akcje

source: Edit
pl: Edytuj

source: Delete
pl: Usuń

source: Save
pl: Zapisz

# confirmUserDelete
source: Are you sure you want to delete user {username}? This action is irreversible.
pl: Czy na pewno chcesz usunąć użytkownika {username}? Ta akcja jest nieodwracalna.

source: You
pl: Ty

source: ← Back to dashboard
pl: ← Powrót do pulpitu

# codeGenerationError
source: An error occurred while generating a new code.
pl: Wystąpił błąd podczas generowania nowego kodu.

# codeCantBeEmpty
source: Code cannot be empty.
pl: Kod nie może być pusty.

source: Error
pl: Błąd

# settingsSaved
source: Settings have been saved.
pl: Ustawienia zostały zapisane.

# settingsSaveError
source: An error occurred while saving settings. ({error})
pl: Wystąpił błąd podczas zapisywania ustawień. ({error})

# settings
source: System settings
pl: Ustawienia systemu

# settingsSubtitle
source: Manage features available to users
pl: Zarządzaj funkcjami dostępnymi dla użytkowników

# accessCode
source: Event access code
pl: Kod dostępu do wydarzenia

# accessCodeDescription
source: You will receive the access code from the event organizers
pl: Kod dostępu otrzymasz od organizatorów wydarzenia

# actualAccessCode
source: Current access code
pl: Aktualny kod dostępu

# shareCode
source: Share this code with event participants
pl: Udostępnij ten kod uczestnikom wydarzenia

source: Copy code
pl: Kopiuj kod

source: Generate new code
pl: Wygeneruj nowy kod

# regenerateCodeWarning
source: Are you sure you want to generate a new code? The old code will stop working!
pl: Czy na pewno wygenerować nowy kod? Stary kod przestanie działać!

# noAccessCode
source: No active access code.
pl: Brak aktywnego kodu dostępu.

# orSetOwnCode
source: Or set your own code
pl: Lub ustaw własny kod

# codeInputTitle
source: 4-20 characters (letters and numbers)
pl: 4-20 znaków (litery i cyfry)

# exampleCode
source: e.g. FUT2025
pl: np. SSPW2025

source: Set code
pl: Ustaw kod

# invalidCodeFormat
source: Code must contain 4-20 characters, only letters and numbers.
pl: Kod musi zawierać 4-20 znaków, tylko litery oraz cyfry.

source: Require access code
pl: Wymagaj kodu dostępu

# requireAccessCodeDescription
source: Require code for login and registration
pl: Wymagaj kodu przy logowaniu i rejestracji

# requireAccessCodeDescriptionSubtitle
source: When enabled, users must provide an access code to log in or register
pl: Gdy włączone, użytkownicy muszą podać kod dostępu aby się zalogować lub zarejestrować

source: User registration
pl: Rejestracja użytkowników

# userRegistrationDescription
source: Allow new user registration
pl: Zezwalaj na rejestrację nowych użytkowników

# userRegistrationDescriptionSubtitle
source: When disabled, new users will not be able to register
pl: Gdy wyłączone, nowi użytkownicy nie będą mogli się zarejestrować

source: User login
pl: Logowanie użytkowników

# userLoginDescription
source: Allow regular user login
pl: Zezwalaj na logowanie zwykłych użytkowników

# userLoginDescriptionSubtitle
source: When disabled, only administrators will be able to log in and use the application
pl: Gdy wyłączone, tylko administratorzy będą mogli się zalogować i korzystać z aplikacji

source: Photo uploads
pl: Przesyłanie zdjęć

# photoUploadsDescription
source: Allow uploading photos for tasks
pl: Zezwalaj na przesyłanie zdjęć do zadań

# photoUploadsDescriptionSubtitle
source: When disabled, users will not be able to upload photos for tasks
pl: Gdy wyłączone, użytkownicy nie będą mogli przesyłać zdjęć do zadań

source: Photo ratings
pl: Ocenianie zdjęć

# photoRatingsDescription
source: Allow rating photos
pl: Zezwalaj na ocenianie zdjęć

# photoRatingsDescriptionSubtitle
source: When disabled, users will not be able to rate photos
pl: Gdy wyłączone, użytkownicy nie będą mogli oceniać zdjęć

source: Save settings
pl: Zapisz ustawienia

source: ← Back to admin panel
pl: ← Powrót do panelu admina

source: ✓ Copied to clipboard!
pl: ✓ Skopiowano do schowka!

# copyError
source: Error copying to clipboard: {error}
pl: Błąd podczas kopiowania do schowka: {error}

# tasksLoadError
source: An error occurred while loading tasks.
pl: Wystąpił błąd podczas ładowania zadań.

source: Task description cannot be empty.
pl: Opis zadania nie może być pusty.

# taskCreated
source: Task has been created.
pl: Zadanie zostało utworzone.

# taskCreationError
source: An error occurred while creating the task.
pl: Wystąpił błąd podczas tworzenia zadania.

# taskUpdated
source: Task has been updated.
pl: Zadanie zostało zaktualizowane.

# taskUpdateError
source: An error occurred while updating the task.
pl: Wystąpił błąd podczas aktualizacji zadania.

# manageTasks
source: Task management
pl: Zarządzanie zadaniami

# manageTasksSubtitle
source: Create, edit and delete tasks
pl: Twórz, edytuj i usuwaj zadania

source: Create new task
pl: Utwórz nowe zadanie

# taskPlaceholder
source: Enter task description...
pl: Wpisz opis zadania...

source: Create task
pl: Utwórz zadanie

# taskList
source: Task list ({count})
pl: Lista zadań ({count})

source: No tasks
pl: Brak zadań

# createSomeTasks
source: Add your first task using the form above.
pl: Dodaj pierwsze zadanie używając formularza powyżej.

source: Times assigned
pl: Razy przypisane

source: Times completed
pl: Razy ukończone

# confirmTaskDelete
source: Are you sure you want to delete this task? It will be deleted along with: - {assigned} assignments - {completed} completions (with photos) This operation is irreversible!
pl: Czy na pewno chcesz usunąć to zadanie? Zostanie ono usunięte razem z: - {assigned} przypisaniami - {completed} wykonaniami (ze zdjęciami) Ta operacja jest nieodwracalna!

# taskHasCompletionsWarning
source: Task has {count, plural, one{{count} completion} other{{count} completions}} - deleting will result in loss of photos!
pl: Zadanie ma {count, plural, one{{count} wykonanie} few{{count} wykonania} other{{count} wykonań}} - usunięcie spowoduje utratę zdjęć!

# errorOccurred
source: An error occurred: {error}
pl: Wystąpił błąd: {error}

# usernameCantBeEmpty
source: Username cannot be empty.
pl: Nazwa użytkownika nie może być pusta.

# usernameChanged
source: Username has been changed.
pl: Nazwa użytkownika została zmieniona.

# cannotChangeOwnPermissions
source: You cannot change your own permissions!
pl: Nie możesz zmienić własnych uprawnień!

# adminStatusChanged
source: Admin status has been changed!
pl: Status administratora został zmieniony!

# adminStatusChangeError
source: An error occurred while changing admin status.
pl: Wystąpił błąd podczas zmiany statusu administratora.

# allFieldsRequired
source: All fields are required.
pl: Wszystkie pola są wymagane.

source: Passwords do not match.
pl: Hasła nie są identyczne.

# passwordChanged
source: Password has been changed!
pl: Hasło zostało zmienione!

# passwordChangeError
source: An error occurred while changing the password.
pl: Wystąpił błąd podczas zmiany hasła.

# editingUser
source: Editing user {username}
pl: Edycja użytkownika {username}

source: Changing username
pl: Zmiana nazwy użytkownika

# changingPassword
source: Changing user password
pl: Zmiana hasła użytkownika

# settingNewPasswordInfo
source: You can set a new password for this user. The user will be able to log in with the new password.
pl: Możesz ustawić nowe hasło dla tego użytkownika. Użytkownik będzie mógł się zalogować nowym hasłem.

source: New password
pl: Nowe hasło

source: Enter new password
pl: Wpisz nowe hasło

source: Confirm password
pl: Potwierdź hasło

source: Confirm new password
pl: Potwierdź nowe hasło

source: Change password
pl: Zmień hasło

source: Admin permissions
pl: Uprawnienia administratora

# actualStatus
source: Current Status
pl: Aktualny Status

source: Revoke permissions
pl: Cofnij uprawnienia

source: Grant permissions
pl: Nadaj uprawnienia

# userPhotos
source: User photos ({count})
pl: Zdjęcia użytkownika ({count})

# noUserPhotos
source: User hasn't uploaded any photos yet.
pl: Użytkownik nie przesłał jeszcze żadnych zdjęć.

source: Photo
pl: Zdjęcie

# confirmPhotoDelete
source: Are you sure you want to delete this photo?
pl: Czy na pewno chcesz usunąć to zdjęcie?

source: Delete user
pl: Usuń użytkownika

# editingTask
source: Editing task #{taskId}
pl: Edycja zadania #{taskId}

# taskStats
source: Task statistics
pl: Statystyki zadania

# taskAlreadyCompletedStats
source: This task has already been completed {count, plural, one{{count} time} other{{count} times}}. Changing the description will not affect already uploaded photos.
pl: To zadanie zostało już wykonane {count, plural, one{{count} raz} other{{count} razy}}. Zmiana opisu nie wpłynie na już przesłane zdjęcia.

source: Edit task description
pl: Edytuj opis zadania

source: ← Back to task list
pl: ← Powrót do listy zadań

source: Delete task
pl: Usuń zadanie

# loginRateLimitReached
source: Too many login attempts! Try again in {count, plural, one{{count} second} other{{count} seconds}}.
pl: Za dużo prób logowania! Spróbuj ponownie za {count, plural, one{{count} sekundę} few{{count} sekundy} other{{count} sekund}}.

# codeIsRequired
source: Access code is required!
pl: Kod dostępu jest wymagany!

# invalidCode
source: Invalid access code!
pl: Nieprawidłowy kod dostępu!

# loginDisabled
source: Login is currently disabled. Only administrators can log in.
pl: Logowanie jest obecnie wyłączone. Tylko administratorzy mogą się zalogować.

# loggedIn
source: Logged in successfully
pl: Zalogowano pomyślnie

# invalidCredentials
source: Invalid username or password. If you forgot your password, contact the Presidium.
pl: Nieprawidłowa nazwa użytkownika lub hasło. Jeśli zapomniałeś hasła, skontaktuj się z Prezydium.

# loginError
source: An error occurred during login. Try again later.
pl: Wystąpił błąd podczas logowania. Spróbuj ponownie później.

# loggingIn
source: Sign In
pl: Logowanie

source: Password
pl: Hasło

source: ← Back to main page
pl: ← Powrót na stronę główną

# registerDisabled
source: Registration is currently disabled.
pl: Rejestracja jest obecnie wyłączona.

# usernameTaken
source: Username is already taken.
pl: Nazwa użytkownika jest już zajęta.

# registerError
source: An error occurred during registration. Try again later.
pl: Wystąpił błąd podczas rejestracji. Spróbuj ponownie później.

# registered
source: Registered successfully
pl: Zarejestrowano pomyślnie

# registering
source: Sign Up
pl: Rejestracja

# gameDisabled
source: The game is currently disabled. Only administrators can use the application.
pl: Gra jest obecnie wyłączona. Tylko administratorzy mogą korzystać z aplikacji.

source: Dashboard
pl: Pulpit

source: Draw task
pl: Losuj zadanie

# drawAgain
source: Draw another
pl: Losuj kolejne

source: Your tasks
pl: Twoje zadania

source: My tasks
pl: Moje zadania

source: User ranking
pl: Ranking uczestników

source: Photo ranking
pl: Ranking zdjęć

# photoRankingTitle
source: Best rated photos
pl: Najlepiej oceniane zdjęcia

# photoRankingDescription
source: Photo ranking by participant ratings
pl: Ranking zdjęć według ocen uczestników

source: Log out
pl: Wyloguj się

# noTasksAssigned
source: You have no assigned tasks
pl: Nie masz przypisanych zadań

# noTasksAssignedDescription
source: Select <a href="/photo_game/actions/draw_task.php"><span class="menu-icon">🎲</span><span>Draw task</span></a> from the menu to draw your first task!
pl: Wybierz opcję <a href="/photo_game/actions/draw_task.php"><span class="menu-icon">🎲</span><span>Losuj zadanie</span></a> w menu, aby wylosować pierwsze zadanie!

source: Select photo
pl: Wybierz zdjęcie

source: Submit
pl: Prześlij

# rankingLoadError
source: An error occurred while loading the ranking.
pl: Wystąpił błąd podczas ładowania rankingu.

# userRankingDescription
source: Top game participants by number of completed tasks
pl: Najlepsi uczestnicy gry według liczby ukończonych zadań

source: Your position
pl: Twoja pozycja

source: Congratulations!
pl: Gratulacje!

# youAreTopUser
source: You are in {position} place in the user ranking!
pl: Zajmujesz {position} miejsce w rankingu uczestników!

# rankingEmpty
source: Ranking is empty.
pl: Ranking jest pusty.

# userRankingEmptyDescription
source: Be the first! Complete tasks and get first place.
pl: Bądź pierwszy! Wykonaj zadania i zdobądź pierwsze miejsce.

# photoRankingEmptyDescription
source: No rated photos. Rate other participants' photos so they appear in the ranking.
pl: Brak ocenionych zdjęć. Oceniaj zdjęcia innych uczestników, aby pojawiły się w rankingu.

source: Go to gallery
pl: Przejdź do galerii

source: Photo not found.
pl: Nie znaleziono zdjęcia.

# photoLoadError
source: An error occurred while loading the photo.
pl: Wystąpił błąd podczas ładowania zdjęcia.

# taskLoadError
source: An error occurred while loading the task.
pl: Wystąpił błąd podczas ładowania zadania.

source: Photo preview
pl: Podgląd zdjęcia

# photoInTop
source: This photo is in TOP {position}!
pl: To zdjęcie jest w TOP {position}!

# photoInTopSpecial
source: {count, plural, one{🎉 Best rated photo in gallery} =2{⭐ Second place in ranking} =3{⭐ Third place in ranking} other{unknown}}!
pl: {count, plural, one{🎉 Najlepiej oceniane zdjęcie w galerii} =2{⭐ Drugie miejsce w rankingu} =3{⭐ Trzecie miejsce w rankingu} other{unknown}}!

source: Task description
pl: Opis zadania

source: Author
pl: Autor

# dateCompleted
source: Completion date
pl: Data wykonania

source: ← Back to gallery
pl: ← Powrót do galerii

source: See ranking
pl: Zobacz ranking

# newTaskAssigned
source: New task drawn. Good luck!
pl: Wylosowano nowe zadanie. Powodzenia!

source: Your new task
pl: Twoje nowe zadanie

# newTaskHint
source: You can upload a photo in the <a href="task_list.php">Your tasks</a> tab.
pl: Możesz przesłać zdjęcie w zakładce <a href="task_list.php">Twoje zadania</a>.
